In [2]:
import gspread

print(gspread.__version__)

6.2.1

In [3]:
import pandas as pd
import gspread

In [20]:
# firstly my excel file convert into the speedsheet then file path working clearly

gc = gspread.service_account(
    filename=r"C:\Users\Tamim\Downloads\testpurpose-477008-1b3347b474b1.json"
)
gc

In [21]:
# sheet file path paste here 
sheet = gc.open_by_url('https://docs.google.com/spreadsheets/d/1LFHioThZ2Hasf_8w63C7GZdtxvV1j7f6MoA4tLC1OR4/edit?usp=sharing')
sheet

In [24]:
ws = sheet.worksheet('Sheet1')
ws

In [25]:
df = pd.DataFrame(ws.get_all_records())
df

    serial   Salary
0         1    1000
1         2    2000
2         3    3000
3         4    4000
4         5    5000
5         6    6000
6         7    7000
7         8    8000
8         9    9000
9        10   10000
10       11   11000
11       12   12000
12       13   13000
13       14   14000
14       15   15000
15       16   16000
16       17   17000
17       18   18000
18       19   19000
19       20   20000
20       21   21000
21       22   22000
22       23   23000
23       24   24000
24       25   25000
25       26   26000
26       27   27000
27       28   28000
28       29   29000
29       30   30000
30       31   31000
31       32   32000
32       33   33000
33       34   34000
34       35   35000
35       36   36000

In [26]:
ws = sheet.worksheet('Sheet2')
df = pd.DataFrame(ws.get_all_records())
df

    Age  Salary
0     1    1000
1     2    2000
2     3    3000
3     4    4000
4     5    5000
5     6    6000
6     7    7000
7     8    8000
8     9    9000
9    10   10000
10   11   11000
11   12   12000
12   13   13000
13   14   14000
14   15   15000
15   16   16000
16   17   17000
17   18   18000
18   19   19000
19   20   20000
20   21   21000
21   22   22000
22   23   23000
23   24   24000
24   25   25000
25   26   26000
26   27   27000
27   28   28000
28   29   29000
29   30   30000
30   31   31000
31   32   32000
32   33   33000
33   34   34000
34   35   35000
35   36   36000

In [28]:
# pandas basica funciton uses

import pandas as pd

df = pd.read_excel(r"C:\Users\Tamim\OneDrive\Documents\anaconda_projects\db\Data.xlsx")
print(df)

    serial   Salary
0         1    1000
1         2    2000
2         3    3000
3         4    4000
4         5    5000
5         6    6000
6         7    7000
7         8    8000
8         9    9000
9        10   10000
10       11   11000
11       12   12000
12       13   13000
13       14   14000
14       15   15000
15       16   16000
16       17   17000
17       18   18000
18       19   19000
19       20   20000
20       21   21000
21       22   22000
22       23   23000
23       24   24000
24       25   25000
25       26   26000
26       27   27000
27       28   28000
28       29   29000
29       30   30000
30       31   31000
31       32   32000
32       33   33000
33       34   34000
34       35   35000
35       36   36000

In [29]:
# how to find data shape means data row and column

df.shape

(36, 2)

In [30]:
row, col = df.shape
row
col

2

In [31]:
row

36

In [32]:
df.head()

   serial   Salary
0        1    1000
1        2    2000
2        3    3000
3        4    4000
4        5    5000

In [34]:
# how to find top nth row
df.head(20)

    serial   Salary
0         1    1000
1         2    2000
2         3    3000
3         4    4000
4         5    5000
5         6    6000
6         7    7000
7         8    8000
8         9    9000
9        10   10000
10       11   11000
11       12   12000
12       13   13000
13       14   14000
14       15   15000
15       16   16000
16       17   17000
17       18   18000
18       19   19000
19       20   20000

In [35]:
# last nth rows

df.tail()

    serial   Salary
31       32   32000
32       33   33000
33       34   34000
34       35   35000
35       36   36000

In [39]:
# find specific column value
df.Salary

0      1000
1      2000
2      3000
3      4000
4      5000
5      6000
6      7000
7      8000
8      9000
9     10000
10    11000
11    12000
12    13000
13    14000
14    15000
15    16000
16    17000
17    18000
18    19000
19    20000
20    21000
21    22000
22    23000
23    24000
24    25000
25    26000
26    27000
27    28000
28    29000
29    30000
30    31000
31    32000
32    33000
33    34000
34    35000
35    36000
Name: Salary, dtype: int64

In [41]:
# jodi multipel key word thake same word a tahole ar use kora jabe na ai vabe

df['Salary']

0      1000
1      2000
2      3000
3      4000
4      5000
5      6000
6      7000
7      8000
8      9000
9     10000
10    11000
11    12000
12    13000
13    14000
14    15000
15    16000
16    17000
17    18000
18    19000
19    20000
20    21000
21    22000
22    23000
23    24000
24    25000
25    26000
26    27000
27    28000
28    29000
29    30000
30    31000
31    32000
32    33000
33    34000
34    35000
35    36000
Name: Salary, dtype: int64

In [42]:
df.columns

Index(['serial ', 'Salary'], dtype='object')

In [45]:
# 2d style a kaj kortece akta column ke

df[['Salary']].head()

   Salary
0    1000
1    2000
2    3000
3    4000
4    5000

In [50]:
type(df['Salary'])

pandas.core.series.Series

In [51]:
type(df[['Salary', 'Salary']])

pandas.core.frame.DataFrame

In [56]:
import pandas as pd

url = 'https://raw.githubusercontent.com/rashakil-ds/5-Minutes-to-Pandas/main/Datasets/Screen%20Time%20Data.csv'
df = pd.read_csv(url)
df.head()

,index,Date,Week Day,Total Screen Time,Social Networking,Reading and Reference,Other,Productivity,Health and Fitness,Entertainment,Creativity,Yoga
0,0,04/17/19,Wednesday,187,89,17,41,22,0,0,0,0
1,1,04/18/19,Thursday,123,78,17,8,9,0,0,0,0
2,2,04/19/19,Friday,112,52,40,8,4,0,3,0,0
3,3,04/20/19,Saturday,101,69,9,38,2,0,3,0,0
4,4,04/21/19,Sunday,56,35,2,43,3,0,1,1,0

In [57]:
# akta column ar max value kivabe ber kore

df['Total Screen Time '].max()

198

In [58]:
# akta column ar min value kivabe ber kore 

df['Total Screen Time '].min()

52

In [59]:
# akta column ar kivabe average value ber kore

df['Total Screen Time '].mean()

np.float64(113.25)

In [60]:
# std mane holo :- standard deviation mane holo ai gula average theke kotota kace or dure ace value gula
df['Total Screen Time '].std()

43.562322320164775

In [61]:
# maximum kon value ta aita ber korar jonno amra mode use kori

df['Entertainment'].mode()

0    0
Name: Entertainment, dtype: int64

In [62]:
df['Entertainment'].value_counts()

Entertainment
0     20
1      4
3      2
32     1
9      1
Name: count, dtype: int64

In [63]:
# 25% modde max value
df['Total Screen Time '].quantile(0.25)

np.float64(83.5)

In [64]:
# 75% modde max value
df['Total Screen Time '].quantile(0.75)

np.float64(137.25)

In [65]:
# 100% modde max value
df['Total Screen Time '].quantile(1)

np.float64(198.0)

In [66]:
# 0% modde max value hoye jabe min value
df['Total Screen Time '].quantile(0)

np.float64(52.0)

In [68]:
df.describe()

,index,Total Screen Time,Social Networking,Reading and Reference,Other,Productivity,Health and Fitness,Entertainment,Creativity,Yoga
count,28.000000,28.000000,28.000000,28.000000,28.000000,28.000000,28.000000,28.000000,28.000000,28.000000
mean,13.500000,113.250000,60.714286,8.714286,14.821429,9.071429,1.285714,1.821429,0.214286,0.571429
std,8.225975,43.562322,22.853571,9.340700,13.754605,6.097532,3.952094,6.188721,0.568112,0.503953
min,0.000000,52.000000,25.000000,0.000000,0.000000,2.000000,0.000000,0.000000,0.000000,0.000000
25%,6.750000,83.500000,41.750000,2.000000,4.750000,3.000000,0.000000,0.000000,0.000000,0.000000
50%,13.500000,111.000000,58.000000,5.000000,9.000000,8.000000,0.000000,0.000000,0.000000,1.000000
75%,20.250000,137.250000,76.500000,13.500000,21.500000,15.000000,0.000000,1.000000,0.000000,1.000000
max,27.000000,198.000000,109.000000,40.000000,43.000000,22.000000,15.000000,32.000000,2.000000,1.000000

In [69]:
df['Social Networking'].sort_values()

8      25
25     28
17     34
4      35
26     37
13     40
27     41
11     42
22     42
12     46
24     49
2      52
21     53
6      56
15     60
16     64
5      68
3      69
20     70
10     75
9      76
1      78
19     81
0      89
14     90
23     93
7      98
18    109
Name: Social Networking, dtype: int64

In [71]:
df['Social Networking'].sort_values(ascending= False)

18    109
7      98
23     93
14     90
0      89
19     81
1      78
9      76
10     75
20     70
3      69
5      68
16     64
15     60
6      56
21     53
2      52
24     49
12     46
11     42
22     42
27     41
13     40
26     37
4      35
17     34
25     28
8      25
Name: Social Networking, dtype: int64

In [72]:
# nth largest column jodi ami dekhte cai tahoole akta specific column base kore 

df.nlargest(10, 'Social Networking')

,index,Date,Week Day,Total Screen Time,Social Networking,Reading and Reference,Other,Productivity,Health and Fitness,Entertainment,Creativity,Yoga
18,18,05/05/19,Sunday,133,109,5,1,3,0,0,0,1
7,7,04/24/19,Wednesday,135,98,3,33,16,0,0,0,0
23,23,05/10/19,Friday,161,93,13,17,16,1,0,0,1
14,14,05/01/19,Wednesday,127,90,0,10,7,0,0,0,1
0,0,04/17/19,Wednesday,187,89,17,41,22,0,0,0,0
19,19,05/06/19,Monday,144,81,4,5,3,0,0,0,1
1,1,04/18/19,Thursday,123,78,17,8,9,0,0,0,0
9,9,04/26/19,Friday,198,76,8,29,15,0,32,0,0
10,10,04/27/19,Saturday,116,75,10,20,5,0,0,0,0
20,20,05/07/19,Tuesday,110,70,5,6,15,0,9,0,1

In [73]:
# nth smallest column jodi ami dekhte cai tahoole akta specific column base kore 

df.nsmallest(10, 'Social Networking')

,index,Date,Week Day,Total Screen Time,Social Networking,Reading and Reference,Other,Productivity,Health and Fitness,Entertainment,Creativity,Yoga
8,8,04/25/19,Thursday,52,25,7,3,16,0,0,0,0
25,25,05/12/19,Sunday,52,28,1,1,6,0,0,1,1
17,17,05/04/19,Saturday,58,34,4,5,3,0,1,0,1
4,4,04/21/19,Sunday,56,35,2,43,3,0,1,1,0
26,26,05/13/19,Monday,61,37,1,0,4,0,0,0,1
13,13,04/30/19,Tuesday,79,40,2,9,12,0,0,0,1
27,27,05/14/19,Tuesday,88,41,2,7,15,0,0,0,1
11,11,04/28/19,Sunday,85,42,22,4,2,0,0,0,0
22,22,05/09/19,Thursday,96,42,15,16,19,0,0,0,1
12,12,04/29/19,Monday,109,46,8,13,9,15,1,0,1